This is used to post error. The "Total Length" parameter must be set to a strictly positive value.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId LengthParameterError { get; }
  Visual Basic
Public Shared ReadOnly Property LengthParameterError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LengthParameterError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarCouplerFailures Class
  Autodesk.Revit.DB Namespace